// -----// IR Dump After mlir::iree_compiler::IREE::HAL::AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After AutoInputConversionPipeline (iree-auto-input-conversion) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After IREEImportPublic (iree-import-public) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After ImportMLProgram (iree-import-ml-program) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After SanitizeModuleNames (iree-sanitize-module-names) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %c64 = arith.constant 64 : index
    %c8192 = arith.constant 8192 : index
    %c0 = arith.constant 0 : index
    %cst = arith.constant 0.000000e+00 : f16
    %0 = util.unfoldable_constant dense<1.000000e+00> : tensor<1x4096xf16>
    %1 = util.unfoldable_constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq_const(%4, dense<4.096000e+03> : tensor<1x32000xf16>) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After Inliner (inline) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
    %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
    %cst_2 = arith.constant 0.000000e+00 : f16
    %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
    %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq(%4, %cst) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After CSE (cse) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
    %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
    %cst_2 = arith.constant 0.000000e+00 : f16
    %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
    %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq(%4, %cst) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
    %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
    %cst_2 = arith.constant 0.000000e+00 : f16
    %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
    %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq(%4, %cst) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After RemoveZeroExtentTensors (iree-global-opt-remove-zero-extent-tensors) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After RemoveZeroExtentTensors (iree-global-opt-remove-zero-extent-tensors) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After DetachElementwiseFromNamedOps (iree-global-opt-detach-elementwise-from-named-ops) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After DetachElementwiseFromNamedOps (iree-global-opt-detach-elementwise-from-named-ops) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-global-opt-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After LiftGenericToTransposeBatchMatmul (iree-global-opt-lift-generic-to-tranpose-batch-matmul) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-global-opt-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After LiftGenericToTransposeBatchMatmul (iree-global-opt-lift-generic-to-tranpose-batch-matmul) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After EraseUnusedLinalgOperands (iree-global-opt-erase-unused-linalg-operands) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
    %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
    %cst_2 = arith.constant 0.000000e+00 : f16
    %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
    %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq(%4, %cst) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After ExpandTensorShapes (iree-flow-expand-tensor-shapes) //----- //
#executable_target_vulkan_spirv_fb = #hal.executable.target<"vulkan", "vulkan-spirv-fb", {spirv.target_env = #spirv.target_env<#spirv.vce<v1.6, [Shader, Float64, Float16, Int64, Int16, Int8, StorageBuffer16BitAccess, StorageUniform16, StoragePushConstant16, StorageBuffer8BitAccess, UniformAndStorageBuffer8BitAccess, StoragePushConstant8, GroupNonUniform, GroupNonUniformVote, GroupNonUniformArithmetic, GroupNonUniformBallot, GroupNonUniformShuffle, GroupNonUniformShuffleRelative, GroupNonUniformClustered, GroupNonUniformQuad, VariablePointers, VariablePointersStorageBuffer, DotProduct, DotProductInputAll, DotProductInput4x8BitPacked, DotProductInput4x8Bit, CooperativeMatrixKHR], [SPV_KHR_16bit_storage, SPV_KHR_8bit_storage, SPV_KHR_integer_dot_product, SPV_KHR_storage_buffer_storage_class, SPV_KHR_variable_pointers, SPV_KHR_cooperative_matrix]>, api=Vulkan, AMD:DiscreteGPU, #spirv.resource_limits<max_compute_shared_memory_size = 65536, max_compute_workgroup_invocations = 1024, max_compute_workgroup_size = [1024, 1024, 1024], subgroup_size = 64, min_subgroup_size = 32, max_subgroup_size = 64, cooperative_matrix_properties_khr = [#spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = i8, b_type = i8, c_type = i32, result_type = i32, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f16, result_type = f16, acc_sat = false, scope = <Subgroup>>, #spirv.coop_matrix_props_khr<m_size = 16, n_size = 16, k_size = 16, a_type = f16, b_type = f16, c_type = f32, result_type = f32, acc_sat = false, scope = <Subgroup>>]>>}>
#device_target_vulkan = #hal.device.target<"vulkan", {executable_targets = [#executable_target_vulkan_spirv_fb], legacy_sync}>
module attributes {hal.device.targets = [#device_target_vulkan]} {
  func.func @main() attributes {iree.abi.stub} {
    call @_main() : () -> ()
    return
  }
  func.func private @_main() {
    %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
    %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
    %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
    %cst_2 = arith.constant 0.000000e+00 : f16
    %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
    %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
    %2 = tensor.empty() : tensor<1x32000xf16>
    %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
    check.expect_eq(%4, %cst) : tensor<1x32000xf16>
    return
  }
}


// -----// IR Dump After ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After GeneralizeLinalgNamedOps (iree-flow-generalize-linalg-named-ops) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After RaiseSpecialOps (iree-flow-raise-special-ops) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After GeneralizeLinalgNamedOps (iree-flow-generalize-linalg-named-ops) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After FoldUnitExtentDims (iree-flow-fold-unit-extent-dims) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After RaiseSpecialOps (iree-flow-raise-special-ops) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After FuseDequantizationMatmul (iree-global-opt-fuse-dequantization-matmul) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After FoldUnitExtentDims (iree-flow-fold-unit-extent-dims) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After CSE (cse) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After FuseDequantizationMatmul (iree-global-opt-fuse-dequantization-matmul) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After CSE (cse) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After SimplifyGlobalAccesses (iree-util-simplify-global-accesses) //----- //
func.func @main() attributes {iree.abi.stub} {
  call @_main() : () -> ()
  return
}

// -----// IR Dump After SimplifyGlobalAccesses (iree-util-simplify-global-accesses) //----- //
func.func private @_main() {
  %cst = arith.constant dense<4.096000e+03> : tensor<1x32000xf16>
  %cst_0 = arith.constant dense<1.000000e+00> : tensor<32000x4096xf16>
  %cst_1 = arith.constant dense<1.000000e+00> : tensor<1x4096xf16>
  %cst_2 = arith.constant 0.000000e+00 : f16
  %0 = util.optimization_barrier %cst_1 : tensor<1x4096xf16>
  %1 = util.optimization_barrier %cst_0 : tensor<32000x4096xf16>
  %2 = tensor.empty() : tensor<1x32000xf16>
  %3 = linalg.fill ins(%cst_2 : f16) outs(%2 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  %4 = linalg.matmul_transpose_b ins(%0, %1 : tensor<1x4096xf16>, tensor<32000x4096xf16>) outs(%3 : tensor<1x32000xf16>) -> tensor<1x32000xf16>
  check.expect_eq(%4, %cst) : tensor<1x32000xf16>
  return
}

// -----// IR Dump After ApplyPatterns (iree-util-apply-patterns) //----- //
